---
type: CableTrayConduitRunBase
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 2
tags: [revit-api, class]
---

# CableTrayConduitRunBase

`Autodesk.Revit.DB.Electrical.CableTrayConduitRunBase` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Length | — | `public double Length { get ; }` |
| Property | Parameter | — | `` |